---
kind: type
id: T:Autodesk.Revit.DB.RevisionVisibility
source: html/486d8b1e-811d-fd43-d2a4-a4eef4e53538.htm
---
# Autodesk.Revit.DB.RevisionVisibility

Determines whether Revision Clouds and Revision Tags will be visible in the project.

## Syntax (C#)
```csharp
public enum RevisionVisibility
```